#+TITLE: Python Introduction

*** Python History
    Python 的创始人为荷兰人吉多·范罗苏姆（Guido van Rossum）。1989 年的圣诞节期间，吉多·范罗苏姆为了在阿姆斯特丹打发时间，决心开发一个新的脚本解释程序，作为 ABC 语言的一种继承。之所以选中 Python 作为程序的名字，是因为他是 BBC 电视剧——蒙提·派森的飞行马戏团（Monty Python's Flying Circus）的爱好者。
    1991 年，第一个 Python 编译器诞生。它是用 C 语言实现的，并能够调用 C 语言的库文件。
    Python 2.0 于 2000 年 10 月 16 日发布，增加了实现完整的垃圾回收，并且支持 Unicode。
    Python 3.0 于 2008 年 12 月 3 日发布，此版不完全兼容之前的 Python 源代码。不过，很多新特性后来也被移植到旧的 Python 2.6/2.7 版本。

*** First Python Code
    #+BEGIN_SRC python :results output
      print("Hello World!")
    #+END_SRC

    #+RESULTS:
    : Hello World!

*** Python 之禅
    #+BEGIN_SRC python :results output
      import this
    #+END_SRC
    
    #+RESULTS:

    #+begin_example
    The Zen of Python, by Tim Peters

    Beautiful is better than ugly.
    Explicit is better than implicit.
    Simple is better than complex.
    Complex is better than complicated.
    Flat is better than nested.
    Sparse is better than dense.
    Readability counts.
    Special cases aren't special enough to break the rules.
    Although practicality beats purity.
    Errors should never pass silently.
    Unless explicitly silenced.
    In the face of ambiguity, refuse the temptation to guess.
    There should be one-- and preferably only one --obvious way to do it.
    Although that way may not be obvious at first unless you're Dutch.
    Now is better than never.
    Although never is often better than *right* now.
    If the implementation is hard to explain, it's a bad idea.
    If the implementation is easy to explain, it may be a good idea.
    Namespaces are one honking great idea -- let's do more of those!
		#+end_example

		这首诗反映了 Python 的设计哲学——Python 是一种追求优雅，明确，简单的编程语言，但事实上，产生这首诗的代码并没有写的那么简单易懂：
    #+BEGIN_SRC python :results output
      s = """Gur Mra bs Clguba, ol Gvz Crgref

      Ornhgvshy vf orggre guna htyl.
      Rkcyvpvg vf orggre guna vzcyvpvg.
      Fvzcyr vf orggre guna pbzcyrk.
      Pbzcyrk vf orggre guna pbzcyvpngrq.
      Syng vf orggre guna arfgrq.
      Fcnefr vf orggre guna qrafr.
      Ernqnovyvgl pbhagf.
      Fcrpvny pnfrf nera'g fcrpvny rabhtu gb oernx gur ehyrf.
      Nygubhtu cenpgvpnyvgl orngf chevgl.
      Reebef fubhyq arire cnff fvyragyl.
      Hayrff rkcyvpvgyl fvyraprq.
      Va gur snpr bs nzovthvgl, ershfr gur grzcgngvba gb thrff.
      Gurer fubhyq or bar-- naq cersrenoyl bayl bar --boivbhf jnl gb qb vg.
      Nygubhtu gung jnl znl abg or boivbhf ng svefg hayrff lbh'er Qhgpu.
      Abj vf orggre guna arire.
      Nygubhtu arire vf bsgra orggre guna *evtug* abj.
      Vs gur vzcyrzragngvba vf uneq gb rkcynva, vg'f n onq vqrn.
      Vs gur vzcyrzragngvba vf rnfl gb rkcynva, vg znl or n tbbq vqrn.
      Anzrfcnprf ner bar ubaxvat terng vqrn -- yrg'f qb zber bs gubfr!"""

      d = {}
      for c in (65, 97):
          for i in range(26):
              d[chr(i + c)] = chr((i + 13) % 26 + c)

      print("".join([d.get(c, c) for c in s]))
    #+END_SRC

    #+RESULTS:
    #+begin_example
    The Zen of Python, by Tim Peters

    Beautiful is better than ugly.
    Explicit is better than implicit.
    Simple is better than complex.
    Complex is better than complicated.
    Flat is better than nested.
    Sparse is better than dense.
    Readability counts.
    Special cases aren't special enough to break the rules.
    Although practicality beats purity.
    Errors should never pass silently.
    Unless explicitly silenced.
    In the face of ambiguity, refuse the temptation to guess.
    There should be one-- and preferably only one --obvious way to do it.
    Although that way may not be obvious at first unless you're Dutch.
    Now is better than never.
    Although never is often better than *right* now.
    If the implementation is hard to explain, it's a bad idea.
    If the implementation is easy to explain, it may be a good idea.
    Namespaces are one honking great idea -- let's do more of those!
#+end_example
